backend/app/controllers/api/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1
---
    def register
      desired_username = user_params[:username].to_s.downcase

      # 🔵 DEFENSA: ¿El nombre le pertenece a un alumno de 42?
      if intra_student_exists?(desired_username)
        # 🛡️ FIX: Devolvemos 200 OK para no pintar la consola de rojo
        render json: {
          ok: false,
          error: "Este nombre está reservado para un estudiante de 42. Si eres tú, inicia sesión con Intra."
        }, status: :ok
        return
      end

      user = User.new(user_params)
      user.otp_secret = ROTP::Base32.random if user.otp_secret.blank?

      if user.save
        UserMailer.with(user: user).confirmation_email.deliver_now

        render json: {
          ok: true,
          message: "Identidad registrada en la base de datos. Se ha enviado un enlace de verificación a tu correo. Revísalo para activar tu cuenta.",
          user: { username: user.username, email: user.email }
        }, status: :created
      else
        # 🛡️ FIX: Atrapamos el error de validación (ej. nombre repetido) y damos 200 OK
        # Ocultamos el log rojo del servidor también
        render json: {
          ok: false,
          error: user.errors.full_messages.first # Mandamos solo el primer error para que sea limpio